Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::RoutingSegmentUIManager Class Referencefinal
MEP Element Manager
The RoutingSegmentUIManager contains UI-related services for a RoutingSegment. More...
#include <MEPRoutingSegmentUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingSegmentUIManager:
 Public Member Functions
Result< RoutingSegmentDefault >  | CreateRoutingSegmentDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a RoutingSegmentDefault from a toolUIData.
Result< void >  | ApplyRoutingSegmentDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const RoutingSegmentDefault &routingSegmentDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< RoutingSegmentUIManager >  | CreateRoutingSegmentUIManager ()
Creates a RoutingSegmentUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingSegmentUIManager contains UI-related services for a RoutingSegment.
Since
Archicad 28
Member Function Documentation
◆ ApplyRoutingSegmentDefaultToToolUIData()
 Result< void > ACAPI::MEP::v1::RoutingSegmentUIManager::ApplyRoutingSegmentDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData &  |  toolUIData,
|  const RoutingSegmentDefault &  |  routingSegmentDefault
)
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
routingSegmentDefault | The default to be set
Returns
Returns error if the RoutingSegmentDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateRoutingSegmentDefaultFromToolUIData()
 Result< RoutingSegmentDefault > ACAPI::MEP::v1::RoutingSegmentUIManager::CreateRoutingSegmentDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData &  |  toolUIData | )
Creates a RoutingSegmentDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the RoutingSegment in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an RoutingSegmentDefault, otherwise returns the RoutingSegmentDefault created from it.
Friends And Related Symbol Documentation
◆ CreateRoutingSegmentUIManager
 Result< RoutingSegmentUIManager > CreateRoutingSegmentUIManager  |  ( |   | )
friend
Creates a RoutingSegmentUIManager.
Returns
If able, creates a new manager for RoutingSegment, otherwise Error.